import { CONFIG } from './config'

export const VALIDGUESSES = [
  'ᒋᐦᒍᐦᐁ',
  'ᐃᓂᓂᔑᑊ',
  'ᐱᐦᐱᐦᒋ',
  'ᑯᐦᑲᒧᐠ',
  'ᒧᓄᑲᐧᓀ',
  'ᐸᐦᐸᐡᑭ',
  'ᔑᑲᐃᐧᐡ',
  'ᐊᐦᔑᑲᐣ',
  'ᑭᓄᔐᐣᐢ',
  'ᐅᐃᐧᐱᒋ',
  'ᑲᐦᑯᒋᐡ',
  'ᒪᐃᐣᑲᐣ', 
  'ᒥᐦᑕᑎᒼ',
  'ᓂᑭᑲᐧᐠ',
  'ᐱᔑᐊᐧᐠ',
  'ᔕᐣᑫᐧᔑ',
  'ᐊᐧᔕᐡᐠ',
  'ᐊᐦᐊᓯ ',
  'ᑫᐦᑫᐠ ',
  'ᔑᐦᔑᑊ ',
  'ᔑᔑᐸᐠ ',
  'ᑭᔭᐡᐠ ',
  'ᐸᓇᐦᐠ ',
  'ᐸᐦᑕᓯ ',
  'ᑭᐁᐧᐅ ',
  'ᒪᓂᒍᐡ ',
  'ᒥᐣᓴᔭ ',
  'ᓇᒣᑯᐢ ',
  'ᐅᑲᐣᐢ ',
  'ᐅᑐᓂᐱ ',
  'ᐊᒋᑕᒧ ',
  'ᐊᒥᐦᐠ ',
  'ᐊᓂᒧᐡ ',
  'ᒪᐦᑲᐧ ',
  'ᒥᔑᐱᓯ ',
  'ᒧᓱᐣᐢ ',
  'ᔑᐣᑯᓯ ',
  'ᐊᐧᑯᐡ '  
];

if (CONFIG.normalization) {
  VALIDGUESSES.forEach(
    (val, i) => (VALIDGUESSES[i] = val.normalize(CONFIG.normalization))
  )
}
